/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   game.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jiyawang <jiyawang@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/21 02:46:03 by jiyawang          #+#    #+#             */
/*   Updated: 2025/09/21 02:46:09 by jiyawang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "so_long.h"

int handle_keypress(int keycode, t_game *game)
{
    // W/A/S/D 对应移动
    // 检查能否移动，不能则不变
    // 移动后计数+1，ft_printf打印步数
    // 收集C、到达E则胜利，退出
    return (0);
}

int init_mlx(t_game *game)
{
    // 初始化mlx，创建窗口，加载贴图
    // 注册键盘事件
    // 注册关闭窗口事件
    return (1);
}
